posts/esim_issue.html
<!DOCTYPE html><html><head><!-- 2025-02-19 --><!-- 2026-01-29 Thu 14:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Not able to comprehend eSIM</title>
<meta name="generator" content="Org Mode" />
<link href="https://fonts.cdnfonts.com/css/share-tech-mono" rel="stylesheet"><link rel="stylesheet" type="text/css" href="/assets/code.css"/><link rel="stylesheet" type="text/css" href="/assets/style.css"/>
</head><body><header><div class="container"><h1>Gold Ayan's Tinker Garage</h1></div><div class="header-content"><nav class="container"><ul class="topnav"><li><a href="/index.html">Home</a></li><li><a href="/projects.html">Projects</a></li><li><a href="/posts">Posts</a></li><li><a href="/til.html">TIL</a></li><li><a href="/blogrolls.html">Blogrolls</a></li><li><a href="/feed.xml">RSS</a></li></ul></nav></div></header><article class="container"><div class="blog-content"><p>
I got a new phone from my office, and I swapped my Airtel 4G SIM to
the new phone, but it didn't work. I borrowed my sibling's SIM to
check if the phone was damaged, and his SIM worked immediately. In
theory, the problem was with my SIM.
</p>

<p>
I approached the Airtel store in our hometown, and I was told to get a
new Airtel SIM for my number. However, since my SIM was originally
purchased under my father's ID, I took my father with me. The SIM was
registered under my father's first name only (what the heck?), not his
full name, and they told us to go to the city Airtel office to get a
new SIM.
</p>

<p>
When I told my friends about the issue, one of them suggested using an
eSIM if my mobile supports it. The good thing is that the process can
be initiated from the Airtel Thanks app. Before proceeding, I wanted
to ensure that my phone number was mapped to the correct email address
because we need a QR code from Airtel to activate the eSIM. After
selecting eSIM on the new phone, it opened a QR scanner so I emailed
Airtel customer care to confirm that (121@in.airtel.com). Got
confirmation that my mail id is mapped to this phone number.
</p>

<p>
I initiated the eSIM process, but I didn't receive any QR email for
eSIM from Airtel, so I emailed customer care about that. I started the
process on Thursday, and after Friday night, incoming calls were
barred—I could only use Online apps like whatsapp and others, and only
mobile data worked.
</p>

<p>
I approached a nearby Airtel store for assistance, and they told me to
buy a replacement SIM. I opted for the eSIM because of the new SIM
issue.
</p>

<p>
Since I had no SIM for personal use no, I decided to buy a new SIM
from a different operator. I inserted the new SIM, restarted the
phone, and it said that the eSIM was detected and that Airtel worked.
</p>

<p>
What??
</p>

<p>
I didn't know what the heck had happened—it worked bizarrely, right?
</p>

<p>
I didn't receive a proper response from either the Airtel store or
Airtel support. We use our mobile numbers as identity for many things,
especially for financial apps.
</p>

<p>
Prevention (my rambling):
</p>
<ul class="org-ul">
<li>If your personal SIM is registered under a parent's name, change it
to your name as soon as possible. This way, if anything happens, you
can take quick action.</li>
<li>Keep a secondary SIM for personal use, such as for staying in touch
with friends and family. If one SIM becomes compromised, you'll have
another way to contact them.</li>
<li>Back up your contacts to the cloud.</li>
</ul>

<p>
What are your prevention mechanism do you use ? file it as issue in
<a href="https://github.com/goldayan/goldayan.github.io/issues">https://github.com/goldayan/goldayan.github.io/issues</a>
</p>
</div></article><footer>This site is made with ❤️ using Emacs.</footer></body></html>
